Revit 2026 API

# PipeSettingsSetDown Property

---

The abbreviation of the Set Down (SD) string.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SetDown { get; set; }
```
```vb
Public Property SetDown As String
	Get
	Set
```
```cpp
public:
property String^ SetDown {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SetDown : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace